{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v3.15.0",
    "modelTopology": {
        "keras_version": "2.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                600,
                                4
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "conv1d_input"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                600,
                                4
                            ],
                            "dtype": "float32",
                            "filters": 100,
                            "kernel_size": [
                                250
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "name": "max_pooling1d",
                            "trainable": true,
                            "dtype": "float32",
                            "strides": [
                                2
                            ],
                            "pool_size": [
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 80,
                            "kernel_size": [
                                30
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "name": "max_pooling1d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "strides": [
                                2
                            ],
                            "pool_size": [
                                2
                            ],
                            "padding": "valid",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_2",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 60,
                            "kernel_size": [
                                10
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten",
                            "trainable": true,
                            "dtype": "float32",
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 500,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "SparseCategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "sparse_categorical_crossentropy",
                    "from_logits": true
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "sparse_categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of3.bin",
                "group1-shard2of3.bin",
                "group1-shard3of3.bin"
            ],
            "weights": [
                {
                    "name": "conv1d/kernel",
                    "shape": [
                        250,
                        4,
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d/bias",
                    "shape": [
                        100
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_1/kernel",
                    "shape": [
                        30,
                        100,
                        80
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_1/bias",
                    "shape": [
                        80
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_2/kernel",
                    "shape": [
                        10,
                        80,
                        60
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_2/bias",
                    "shape": [
                        60
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        3840,
                        500
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        500
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        500,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}